---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
source: html/82a924a4-789b-0bb2-766e-2a634cab0151.htm
---
# StructuralSectionGeneralF Methods

Returns size of the section boundary.